# Sum & Mean Functions

In [1]:
import pandas as pd

In [2]:
d = {'Name':pd.Series(['Tom','James','Alex']),'Age':pd.Series([23,45,86]),'Rating':pd.Series([23.5,55,86.5])}
df = pd.DataFrame(d)
df

    Name  Age  Rating
0    Tom   23    23.5
1  James   45    55.0
2   Alex   86    86.5

In [3]:
print(df.sum())

Name      TomJamesAlex
Age                154
Rating           165.0
dtype: object

In [4]:
df.mean()

C:\Users\os\AppData\Local\Temp\ipykernel_6480\3698961737.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

Age       51.333333
Rating    55.000000
dtype: float64

In [5]:
print(df.median())

Age       45.0
Rating    55.0
dtype: float64

C:\Users\os\AppData\Local\Temp\ipykernel_6480\4259369830.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  print(df.median())

In [6]:
print(df.mode())

    Name  Age  Rating
0   Alex   23    23.5
1  James   45    55.0
2    Tom   86    86.5

# describe()

In [7]:
print(df) # the dataframe

print()

df.describe()

    Name  Age  Rating
0    Tom   23    23.5
1  James   45    55.0
2   Alex   86    86.5

             Age  Rating
count   3.000000    3.00
mean   51.333333   55.00
std    31.973948   31.50
min    23.000000   23.50
25%    34.000000   39.25
50%    45.000000   55.00
75%    65.500000   70.75
max    86.000000   86.50

# Text Data

In [8]:
s=pd.Series(['Tom',' Jame s ','Alex'])
s

0         Tom
1     Jame s
2        Alex
dtype: object

In [9]:
s.str.lower()

0         tom
1     jame s
2        alex
dtype: object

In [10]:
s.str.upper()

0         TOM
1     JAME S
2        ALEX
dtype: object

In [11]:
s.str.len()

0    3
1    8
2    4
dtype: int64

In [12]:
s.str.strip()

0       Tom
1    Jame s
2      Alex
dtype: object

In [13]:
s.str.split()
s.str.len()

0    3
1    8
2    4
dtype: int64

In [14]:
s.str.split(' ')
s.str.len()

0    3
1    8
2    4
dtype: int64

In [15]:
s.str.get_dummies() #one hot encoding
#use: in ML, machine can't read strings directly so it is useful for giving values in 0, 1 format

    Jame s   Alex  Tom
0         0     0    1
1         1     0    0
2         0     1    0

In [16]:
s.str.contains(' ')

0    False
1     True
2    False
dtype: bool

In [17]:
print(s.str.replace('o','#'))

0         T#m
1     Jame s
2        Alex
dtype: object

# iterating a dataframe

In [18]:
df = pd.DataFrame({'A':[1,9,7],'B':[20,22,29],'C':[40,43,44]})
df

   A   B   C
0  1  20  40
1  9  22  43
2  7  29  44

In [19]:
df = pd.DataFrame({'A':[1,9,7],'B':[20,22,29],'C':[40,43,44]})
for pqr in df:
    print(pqr) #it will return column names

A
B
C

In [20]:
#2 of 3 methods for iteration
# iteritems() to iterate over key value pairs (iterate over the columns ultimatly)
# iterrows() to iterate over rows (index, series) pairs

In [21]:
for key,value in df.iteritems():
    print(key,value)

A 0    1
1    9
2    7
Name: A, dtype: int64
B 0    20
1    22
2    29
Name: B, dtype: int64
C 0    40
1    43
2    44
Name: C, dtype: int64

In [22]:
for row_index,row in df.iterrows():
    print(row_index,row)

0 A     1
B    20
C    40
Name: 0, dtype: int64
1 A     9
B    22
C    43
Name: 1, dtype: int64
2 A     7
B    29
C    44
Name: 2, dtype: int64

# functions applications

In [23]:
#table wise pipe()
import numpy as np

def adder(ele1,ele2):
    return ele1+ele2

print(df.pipe(adder,2))
df.apply(np.mean)

    A   B   C
0   3  22  42
1  11  24  45
2   9  31  46

A     5.666667
B    23.666667
C    42.333333
dtype: float64

In [24]:
#row & column wise apply()
def adder(ele1,ele2):
    return ele1+ele2

df.apply(np.mean,axis=1)

0    20.333333
1    24.666667
2    26.666667
dtype: float64

In [25]:
def adder(ele1,ele2):
    return ele1+ele2

df.apply(lambda x:x.max()-x.min())

A    8
B    9
C    4
dtype: int64

In [26]:
#element wise applymap()

def adder(ele1,ele2):
    return ele1+ele2

df.applymap(lambda x:x*100)

     A     B     C
0  100  2000  4000
1  900  2200  4300
2  700  2900  4400